# IsCurtainWall

## Description
Use to check whether wall is being used as a curtain wall.

```pascal
FUNCTION IsCurtainWall(hWall : HANDLE): BOOLEAN;
```

```python
def vs.IsCurtainWall(hWall):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hWall|HANDLE|Handle to a wall object to check for curtain wall status|

## Version
Availability: from Vectorworks 2014

## Category
* Objects - Walls